package by.htp.task.sort;

public class Task09 {

	/*
	 * 9. Алгоритм фон Неймана. Упорядочить массив a a an , , , 1 2  по неубыванию
	 * с помощью алгоритма сортировки слияниями: 1) каждая пара соседних элементов
	 * сливается в одну группу из двух элементов (последняя группа может состоять из
	 * одного элемента); 2) каждая пара соседних двухэлементных групп сливается в
	 * одну четырехэлементную группу и т. д. При каждом слиянии новая укрупненная
	 * группа упорядочивается.
	 */

	public static void main(String[] args) {
		

	}

}
